
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Die Zensursula Diskussion - Oliver Thylmann</title>
  <meta name="author" content="Oliver Thylmann">

  
  <meta name="description" content="&lt;p&gt;Info: This post is in German as it is Germany focussed and the english speaking crowd can probably ignore it, even though it is an &hellip;">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://thylmann.net/blog/2009/06/16/die-zensursula-diskussion">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="/javascripts/ender.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="/atom.xml" rel="alternate" title="Oliver Thylmann" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">

  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-51635-10']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


</head>

<body   >
  <header role="banner"><hgroup>
  <h1><a href="/">Oliver Thylmann</a></h1>
  
    <h2>The ramblings of somebody that likes to do that.</h2>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscription" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
  
<form action="http://google.com/search" method="get">
  <fieldset role="search">
    <input type="hidden" name="q" value="site:thylmann.net" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
  
<ul class="main-navigation">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article class="hentry" role="article">
  
  <header>
    
      <h1 class="entry-title">Die Zensursula Diskussion</h1>
    
    
      <p class="meta">
        








  


<time datetime="2009-06-16T18:34:00+02:00" pubdate data-updated="true">Jun 16<span>th</span>, 2009</time>
        
      </p>
    
  </header>


<div class="entry-content"><p>&lt;p&gt;Info: This post is in German as it is Germany focussed and the english speaking crowd can probably ignore it, even though it is an interesting subject.&lt;/p&gt;</p>

<p>&lt;p&gt;So. Eigentlich wollte ich ja gar nichts schreiben, aber auf Twitter ist eine kleine Diskussion &amp;uuml;ber <a href="http://twitter.com/o/status/2193814860">einen meiner Beitr&amp;auml;ge</a>&amp;nbsp;losgebrochen das ich doch mal was schreiben muss. Diesmal sogar auch deutsch auch wenn ich eigentlich nur auf englisch schreibe. Man verzeihe mir die Rechtschreibfehler.&lt;/p&gt;</p>

<p>&lt;p&gt;Zuerst zu mir:&amp;nbsp;&lt;/p&gt;</p>

<p>&lt;ul&gt;
&lt;li&gt;Ich habe DNS Server administriert&lt;/li&gt;
&lt;li&gt;Ich habe Netzwerke aufgebaut&lt;/li&gt;
&lt;li&gt;Ich habe shared hosting system aufgesetzt und betreut&lt;/li&gt;
&lt;li&gt;Ich habe mal eine Porn Seite entdeckt und vom netz genommen die von Deutschland aus gar nicht zu sehen war (filter in Apache auf deutsche IPs)&lt;/li&gt;
&lt;li&gt;Ich habe load-balanced server systeme entwickelt, betrieben, etc.&lt;/li&gt;
&lt;li&gt;Ich habe mit Leuten gearbeitet die <em>wirklich</em> wissen was Sicherheit in Bezug auf Internetseiten bedeutet&lt;/li&gt;
&lt;/ul&gt;</p>

<p>&lt;p&gt;&amp;nbsp;Die Liste lie&amp;szlig;e sich noch weiter f&amp;uuml;hren, aber ich denke der Punkt ist gebraucht. In Bezug auf Internet Infrastruktur, Netzwerke, Sicherheit, und verwandte Themen bin ich nicht ganz auf den Kopf gefallen.&lt;/p&gt;</p>

<p>&lt;p&gt;N&amp;auml;chster Punkt. <a href="http://ibrahimevsan.de/">Ibo</a> hat netter weise mal den relevanten Teil &amp;uuml;ber Zensur auf dem Grundgesetzt ins Netz gestellt. Ich zitiere hier auch mal:&lt;/p&gt;</p>

<p>&lt;blockquote&gt;
&lt;p&gt;(1) Jeder hat das Recht, seine Meinung in Wort, Schrift und Bild frei zu &amp;auml;u&amp;szlig;ern und zu verbreiten und sich aus allgemein zug&amp;auml;nglichen Quellen ungehindert zu unterrichten. Die Pressefreiheit und die Freiheit der Berichterstattung durch Rundfunk und Film werden gew&amp;auml;hrleistet. Eine Zensur findet nicht statt.&lt;/p&gt;
&lt;p&gt;(2) Diese Rechte finden ihre Schranken in den Vorschriften der allgemeinen Gesetze, den gesetzlichen Bestimmungen zum Schutze der Jugend und in dem Recht der pers&amp;ouml;nlichen Ehre.&lt;/p&gt;
&lt;p&gt;(3) Kunst und Wissenschaft, Forschung und Lehre sind frei. Die Freiheit der Lehre entbindet nicht von der Treue zur Verfassung.&lt;/p&gt;
&lt;/blockquote&gt;</p>

<p>&lt;p&gt;So nett das gemeint war, damit sollte eigentlich Zensur vom Tisch sein. Wenn ich das richtig verstehe, dann sind illegale Materialien von Zensur nicht gesch&amp;uuml;tzt. Siehe Punkt 2.. Das ist eigentlich auch der gr&amp;ouml;&amp;szlig;te Punkt an der Diskussion der mich st&amp;ouml;rt. H&amp;ouml;rt verdammt nochmal auf von Zensur zu sprechen. Das bringt niemandem etwas. Das die Infrastruktur die da gebaut werden soll eventuel auch f&amp;uuml;r Zensur genutzt werden kann ist absolut klar, aber einfach nicht der Punkt. Wir k&amp;ouml;nnen ja nicht anfangen jedes Gesetz so auszulegen, dass es nur da sein darf wenn es bei Fehlinterpretation und Missbrauch illegal ist. Dann k&amp;ouml;nnen wir ja gleich alles aufgeben. Und nach meinem momentanen Wissensstand soll nun eine Kontrollinstanz da sein. Sollte dies nicht der Fall sein muss das erstmal berichtigt werden und das sollte auch jedem einfach klar sein.&lt;/p&gt;</p>

<p>&lt;p&gt;An alle die sich so &amp;uuml;ber Zensur aufregen: warum sehe ich keine lauten Schreie &amp;uuml;ber <a href="http://en.wikipedia.org/wiki/DNSBL">Real Time Blackhole Lists</a>??? Euer email server provider kann das bei sich einbauen und sollte irgendwer auf der Welt sagen ich spamme von meinem Server (oder genauer gesagt irgendwer der meinen Server irgendwie nutzt) dann kommt der Server auf die RBL und meine Mail kommt bei euch nie an und ihr wisst es nicht. Also fangt da mal bitte an zu k&amp;auml;mpfen. Weil Spam ist ja noch nicht mal illegal! Und das muss auch keine unbedingt pr&amp;uuml;fen, ganz besonders kein Staat.&amp;nbsp;&lt;/p&gt;</p>

<p>&lt;p&gt;Der Hauptpunkt ist aber der hier: Dieses vorgeschlagene System ist absoluter Mumpitz und bringt gar nichts. Nochmal: Ich glaube nicht an dieses System. Ich glaube nur das Zensur der falsche Angriffspunkt ist. Das Problem mit dem System muss man an guten Beispielen erkl&amp;auml;ren und einfach klar machen und sich nicht in einem Netz von Diskussionen &amp;uuml;ber eine eventuel m&amp;ouml;gliche Zensur verstricken. Auch das Argument das als n&amp;auml;chstes Deep Packet Inspection kommt z&amp;auml;hlt nicht, weil da hat Phorm in UK gezeigt wie das nach hinten los geht.&amp;nbsp;&lt;/p&gt;</p>

<p>&lt;p&gt;Also warum ist das ganze denn nun wirklich bl&amp;ouml;d. Es geht nicht, zumindest nicht wirklich. Das wissen aber eigentlich auch schon alle. Da wir aber auch alle wollen, dass Kinderpornographie, bzw. noch viel weiter gedacht, der Missbrauch von Kindern, aufh&amp;ouml;rt und nie wieder passiert, brauchen wir eine L&amp;ouml;sung. Und die Aussage &quot;wir haben ja Gesetze dagegen&quot; kaufe ich nicht ab. Die Digerati wie ich sie mal nennen will sollte doch mal auf eine sinnvolle und effiziente L&amp;ouml;sung kommen. Zumindest eine Diskussion mit Ziel eine L&amp;ouml;sung w&amp;auml;re echt mal interessant.&amp;nbsp;&lt;/p&gt;</p>

<p>&lt;p&gt;Viel filesharing l&amp;auml;uft &amp;uuml;ber P2P, IRC, Newsnet, oder &amp;auml;hnliches. Das ist alles raus. W&amp;uuml;rde man hier Namen von Servern sperren, w&amp;uuml;rden auch ganz viele legale Inhalte geblockt werden, was nicht sein darf. Also nochmal: Das ganze geht nicht f&amp;uuml;r die Infrastruktur wo im Moment jeder Internet Nutzer 90% seiner illegalen Downloads her hat (tut nat&amp;uuml;rlich keiner, nur um das auch klar zu machen ;)). Das gleiche gilt ja auch f&amp;uuml;r Webserver wo nicht nur illegale Materialien sind. Dies exkludiert also alle Webseiten die gehackt worden sind, oder die shared hosts sind, also nicht nur eine Webseite hosten.&lt;/p&gt;</p>

<p>&lt;p&gt;Also geht es nur um Webseiten wo wir quasi nur Kinderpornographie finden, unter einer Domain, unter der sonst nichts zu finden ist. Als solches ist das ganze ja schon recht unwahrscheinlich. Dann ist aber noch das Problem das man einfach nur seinen eigenen DNS Server austauschen muss und das ganze ist schon wieder vorbei. Oder einen Anonymous Proxy wenn ich das richtig sehe (wei&amp;szlig; im Moment nicht genau ob mein Rechner zumindest den DNS request durchf&amp;uuml;hrt oder nicht).&lt;/p&gt;</p>

<p>&lt;p&gt;Jetzt m&amp;uuml;sste man aber mal ein Beispiel bauen, so das das ganze sehr einfach jedem gezeigt werden kann der f&amp;uuml;r oder gegen dieses Gesetz stimmen kann. So k&amp;ouml;nnte man dann einfach jeden Anrufen oder EMail schicken oder Briefe oder mit LCD Monitoren auf dem Auto neben deren Auto her fahren. Was immer auch. Man k&amp;ouml;nnte etwas tun. Zur Zeit der Versteigerung der UMTS lizenzen hat Nokia mal rausgefunden was die Fahrwege sind von den Entscheidern f&amp;uuml;r Netzwerkinfrastruktur bei den gro&amp;szlig;en Mobilfunkanbietern. Dann haben sie einfach diesen Arbeitsweg zugekleistert. Sehr interessant.&lt;/p&gt;</p>

<p>&lt;p&gt;Einfach w&amp;auml;re eine Flash Animation mit einem Besuch einer Seite, einem zweiten Besuch mit STOP schild, ein Durchlauf durch &amp;Auml;nderung der DNS Einstellungen, noch ein Besuch der Webseite. Sch&amp;ouml;ner w&amp;auml;re die M&amp;ouml;glichkeit das Live am Screen zeigen zu k&amp;ouml;nnen, also quasi ein Demo am eigenen Rechner (an dem diese Leute wahrscheinlich gar nix &amp;auml;ndern k&amp;ouml;nnen). Auch interessant w&amp;auml;re verschiedene Seiten von Bundestagsmitgliedern so zu manipulieren das dort ein Bild zu sehen ist das dort nicht hin geh&amp;ouml;rt, muss ja nicht illegal sein, so das klar ist das diese ganze Seite potentiell gesperrt w&amp;uuml;rde. Wie schon erw&amp;auml;hnt, denke ich, dass mit ein wenig Kreativit&amp;auml;t da wirklich was interessantes aufzusetzen ist. Es muss einfach <em>gezeigt</em> werden das dies nicht wirklich funktioniert.&lt;/p&gt;</p>

<p>&lt;p&gt;Als zweiten Schritt muss dann noch ein weiteres Konzept gefunden werden wie man das Problem bek&amp;auml;mpft, sowohl Kindesmissbrauch als auch Kinderpornographie im Internet. Das ist ganz besonders wichtig weil ja schon klar geworden ist das ein Gro&amp;szlig;teil dessen &amp;uuml;ber dieses System gar nicht beblockt wird. Ich finde hier grunds&amp;auml;tzlich die Idee eines anonymisierten Crowdsourcing Tools zur Meldung, &amp;Uuml;berpr&amp;uuml;fung, Entfernung, Ermittlung, etc&#8230; . An dieser Stelle k&amp;ouml;nnte jeder Anonym Informationen einreichen. Diese Daten werden so aufgeteilt das sie nicht zum Ziel f&amp;uuml;hren aber die einzelnen Teile angereichert werden k&amp;ouml;nnen mit mehr Informationen (z.B. &quot;Kontaktdaten zu Hoster von IP adressse X&quot;). Das ganze wird mit API aufgesetzt das jeder sich andocken kann. Auchtung, das ist auch nur eine Idee.&lt;/p&gt;</p>

<p>&lt;p&gt;Ich denke ich habe meinen Punkt klar gemacht. Gesetz ist bl&amp;ouml;d. Zensur der falsche Kampf. Ist auch nur meine Meinung, andere akzeptiere ich gerne. Dachte blos das ich das ganze nicht in 140 Zeichen-St&amp;uuml;cken sagen kann ;)&lt;/p&gt;</p>

<p>&lt;p&gt;But we need a constructive give examples call constituients and explain why stupid and that we should work together with hackers, police and porn to solve the problem&lt;/p&gt;</p>

<p>&lt;script src=&quot;http://ads.adcloud.net/s/129.js&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;</p>
</div>


  <footer>
    <p class="meta">
      
  

<span class="byline author vcard">Posted by <span class="fn">Oliver Thylmann</span></span>

      








  


<time datetime="2009-06-16T18:34:00+02:00" pubdate data-updated="true">Jun 16<span>th</span>, 2009</time>
      

<span class="categories">
  
    <a class='category' href='/blog/categories/general/'>General</a>, <a class='category' href='/blog/categories/life/'>Life</a>, <a class='category' href='/blog/categories/in/'>in</a>
  
</span>


    </p>
    
      <div class="sharing">
  
  <a href="http://twitter.com/share" class="twitter-share-button" data-url="http://thylmann.net/blog/2009/06/16/die-zensursula-diskussion/" data-via="othylmann" data-counturl="http://thylmann.net/blog/2009/06/16/die-zensursula-diskussion/" >Tweet</a>
  
  
  <div class="g-plusone" data-size="medium"></div>
  
  
    <div class="fb-like" data-send="true" data-width="450" data-show-faces="false"></div>
  
</div>

    
    <p class="meta">
      
        <a class="basic-alignment left" href="/blog/2009/06/16/moved-blog-to-squarespace/" title="Previous Post: Moved Blog to Squarespace">&laquo; Moved Blog to Squarespace</a>
      
      
        <a class="basic-alignment right" href="/blog/2009/07/16/the-twittergate-document-leakage/" title="Next Post: The Twittergate Document Leakage">The Twittergate Document Leakage &raquo;</a>
      
    </p>
  </footer>
</article>

</div>

<aside class="sidebar">
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/blog/2011/06/05/the-story-of-bitcoin/">The Story of Bitcoin</a>
      </li>
    
      <li class="post">
        <a href="/blog/2011/01/07/last-post-in-may/">Last post in May</a>
      </li>
    
      <li class="post">
        <a href="/blog/2010/05/24/the-privacy-concern-zuckerberg-did-not-answer/">The privacy concern Zuckerberg did not answer</a>
      </li>
    
      <li class="post">
        <a href="/blog/2010/05/23/android-killed-the-iphone-long-live-the-iphone/">Android killed the iPhone - Long live the iPhone</a>
      </li>
    
      <li class="post">
        <a href="/blog/2010/02/20/the-solutions-for-the-plain-text-nut/">The solutions for the plain text nut</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>GitHub Repos</h1>
  <ul id="gh_repos">
    <li class="loading">Status updating...</li>
  </ul>
  
  <a href="https://github.com/othylmann">@othylmann</a> on GitHub
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'othylmann',
            count: 0,
            skip_forks: true,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>


<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating...</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("othylmann", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/othylmann" class="twitter-follow-button" data-show-count="true">Follow @othylmann</a>
  
</section>


<section>
  <h1>My Pinboard</h1>
  <ul id="pinboard_linkroll">Fetching linkroll...</ul>
  <p><a href="http://pinboard.in/u:othylmann">My Pinboard Bookmarks &raquo;</a></p>
</section>
<script type="text/javascript">
  var linkroll = 'pinboard_linkroll'; //id target for pinboard list
  var pinboard_user = "othylmann"; //id target for pinboard list
  var pinboard_count = 3; //id target for pinboard list
  (function(){
    var pinboardInit = document.createElement('script');
    pinboardInit.type = 'text/javascript';
    pinboardInit.async = true;
    pinboardInit.src = '/javascripts/pinboard.js';
    document.getElementsByTagName('head')[0].appendChild(pinboardInit);
  })();
</script>




  
</aside>


    </div>
  </div>
  <footer role="contentinfo"><p>
  Copyright &copy; 2012 - Oliver Thylmann -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  



<div id="fb-root"></div>
<script>(function(d, s, id) {
  var js, fjs = d.getElementsByTagName(s)[0];
  if (d.getElementById(id)) {return;}
  js = d.createElement(s); js.id = id;
  js.src = "//connect.facebook.net/en_US/all.js#appId=212934732101925&xfbml=1";
  fjs.parentNode.insertBefore(js, fjs);
}(document, 'script', 'facebook-jssdk'));</script>



  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>



  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
